QUESTIONS = [

    {

        "question": "Какой климат вам комфортнее?",

        "options": [

            {

                "text": "Арктический холод",

                "excludes": ["Фенек", "Красный фламинго", "Лемур кошачий", "Черный лебедь"],

                "weights": {

                    "Амурский тигр": 6,

                    "Белый медведь": 10,

                    "Ирбис (снежный барс)": 8,

                    "Манул": 7,

                    "Японский журавль": 3

                }

            },

            {

                "text": "Жаркие тропики",

                "excludes": ["Белый медведь", "Ирбис (снежный барс)", "Манул"],

                "weights": {

                    "Амурский тигр": 5,

                    "Фенек": 10,

                    "Красный фламинго": 9,

                    "Лемур кошачий": 8,

                    "Черный лебедь": 6,

                    "Японский журавль": 5

                }

            },

            {

                "text": "Умеренный",

                "excludes": ["Фенек", "Белый медведь"],

                "weights": {

                    "Амурский тигр": 9,

                    "Ирбис (снежный барс)": 7,

                    "Манул": 8,

                    "Красный фламинго": 6,

                    "Лемур кошачий": 7,

                    "Черный лебедь": 5,

                    "Японский журавль": 6

                }

            },

            {

                "text": "Горный",

                "excludes": ["Красный фламинго", "Черный лебедь"],

                "weights": {

                    "Амурский тигр": 8,

                    "Белый медведь": 5,

                    "Ирбис (снежный барс)": 10,

                    "Манул": 9,

                    "Фенек": 4,

                    "Лемур кошачий": 3,

                    "Японский журавль": 2

                }

            }

        ]

    },

    {

        "question": "Какую пищу вы предпочитаете?",

        "options": [

            {

                "text": "Мясо",

                "excludes": ["Красный фламинго", "Лемур кошачий"],

                "weights": {

                    "Амурский тигр": 10,

                    "Белый медведь": 8,

                    "Ирбис (снежный барс)": 9,

                    "Манул": 7,

                    "Фенек": 6,

                    "Черный лебедь": 2,

                    "Японский журавль": 3

                }

            },

            {

                "text": "Рыба",

                "excludes": ["Фенек", "Манул"],

                "weights": {

                    "Амурский тигр": 7,

                    "Белый медведь": 10,

                    "Ирбис (снежный барс)": 6,

                    "Красный фламинго": 4,

                    "Черный лебедь": 8,

                    "Лемур кошачий": 3,

                    "Японский журавль": 9

                }

            },

            {

                "text": "Фрукты",

                "excludes": ["Белый медведь", "Ирбис (снежный барс)"],

                "weights": {

                    "Амурский тигр": 4,

                    "Манул": 3,

                    "Фенек": 8,

                    "Красный фламинго": 7,

                    "Лемур кошачий": 10,

                    "Черный лебедь": 6,

                    "Японский журавль": 5

                }

            },

            {

                "text": "Насекомые",

                "excludes": ["Белый медведь", "Амурский тигр"],

                "weights": {

                    "Ирбис (снежный барс)": 3,

                    "Манул": 4,

                    "Фенек": 9,

                    "Красный фламинго": 10,

                    "Лемур кошачий": 8,

                    "Черный лебедь": 7,

                    "Японский журавль": 6

                }

            }

        ]

    },

    {

        "question": "Ваш стиль общения?",

        "options": [

            {

                "text": "Одиночка",

                "excludes": ["Красный фламинго", "Лемур кошачий"],

                "weights": {

                    "Амурский тигр": 8,

                    "Белый медведь": 7,

                    "Ирбис (снежный барс)": 10,

                    "Манул": 9,

                    "Фенек": 6,

                    "Черный лебедь": 5,

                    "Японский журавль": 4

                }

            },

            {

                "text": "Семейный",

                "excludes": ["Ирбис (снежный барс)", "Манул"],

                "weights": {

                    "Амурский тигр": 4,

                    "Белый медведь": 3,

                    "Фенек": 7,

                    "Красный фламинго": 9,

                    "Лемур кошачий": 10,

                    "Черный лебедь": 8,

                    "Японский журавль": 6

                }

            },

            {

                "text": "Стайный",

                "excludes": ["Белый медведь", "Амурский тигр"],

                "weights": {

                    "Ирбис (снежный барс)": 3,

                    "Манул": 2,

                    "Фенек": 8,

                    "Красный фламинго": 10,

                    "Лемур кошачий": 9,

                    "Черный лебедь": 7,

                    "Японский журавль": 6

                }

            }

        ]

    },

    {

        "question": "Как вы реагируете на опасность?",

        "options": [

            {

                "text": "Атакую первым",

                "excludes": ["Лемур кошачий", "Красный фламинго"],

                "weights": {

                    "Амурский тигр": 10,

                    "Белый медведь": 9,

                    "Ирбис (снежный барс)": 8,

                    "Манул": 7,

                    "Фенек": 5,

                    "Черный лебедь": 3,

                    "Японский журавль": 4

                }

            },

            {

                "text": "Ищу укрытие",

                "excludes": ["Амурский тигр", "Белый медведь"],

                "weights": {

                    "Ирбис (снежный барс)": 6,

                    "Манул": 8,

                    "Фенек": 9,

                    "Красный фламинго": 7,

                    "Лемур кошачий": 7,

                    "Черный лебедь": 5,

                    "Японский журавль": 6

                }

            },

            {

                "text": "Сохраняю спокойствие",

                "excludes": ["Фенек", "Манул"],

                "weights": {

                    "Амурский тигр": 7,

                    "Белый медведь": 6,

                    "Ирбис (снежный барс)": 5,

                    "Красный фламинго": 8,

                    "Лемур кошачий": 9,

                    "Черный лебедь": 7,

                    "Японский журавль": 6

                }

            }

        ]

    },

    {

        "question": "Где вы предпочитаете жить?",

        "options": [

            {

                "text": "Лес",

                "excludes": ["Фенек", "Черный лебедь"],

                "weights": {

                    "Амурский тигр": 10,

                    "Белый медведь": 6,

                    "Ирбис (снежный барс)": 8,

                    "Манул": 7,

                    "Красный фламинго": 3,

                    "Лемур кошачий": 5,

                    "Японский журавль": 4

                }

            },

            {

                "text": "Пустыня",

                "excludes": ["Белый медведь", "Ирбис (снежный барс)"],

                "weights": {

                    "Амурский тигр": 3,

                    "Манул": 2,

                    "Фенек": 10,

                    "Красный фламинго": 7,

                    "Лемур кошачий": 6,

                    "Черный лебедь": 4,

                    "Японский журавль": 5

                }

            },

            {

                "text": "Горы",

                "excludes": ["Красный фламинго", "Лемур кошачий"],

                "weights": {

                    "Амурский тигр": 7,

                    "Белый медведь": 5,

                    "Ирбис (снежный барс)": 10,

                    "Манул": 9,

                    "Фенек": 6,

                    "Черный лебедь": 4,

                    "Японский журавль": 3

                }

            },

            {

                "text": "Водоемы",

                "excludes": ["Фенек", "Манул"],

                "weights": {

                    "Амурский тигр": 4,

                    "Белый медведь": 9,

                    "Ирбис (снежный барс)": 3,

                    "Красный фламинго": 7,

                    "Лемур кошачий": 5,

                    "Черный лебедь": 8,

                    "Японский журавль": 6

                }

            }

        ]

    },

    {

        "question": "Ваше любимое время суток?",

        "options": [

            {

                "text": "Ночь",

                "excludes": ["Красный фламинго", "Японский журавль"],

                "weights": {

                    "Амурский тигр": 8,

                    "Белый медведь": 6,

                    "Ирбис (снежный барс)": 9,

                    "Манул": 10,

                    "Фенек": 7,

                    "Лемур кошачий": 5,

                    "Черный лебедь": 4

                }

            },

            {

                "text": "Утро",

                "excludes": ["Фенек", "Манул"],

                "weights": {

                    "Амурский тигр": 5,

                    "Белый медведь": 7,

                    "Ирбис (снежный барс)": 4,

                    "Красный фламинго": 9,

                    "Лемур кошачий": 8,

                    "Черный лебедь": 6,

                    "Японский журавль": 10

                }

            },

            {

                "text": "День",

                "excludes": ["Ирбис (снежный барс)", "Манул"],

                "weights": {

                    "Амурский тигр": 6,

                    "Белый медведь": 5,

                    "Фенек": 8,

                    "Красный фламинго": 10,

                    "Лемур кошачий": 7,

                    "Черный лебедь": 9,

                    "Японский журавль": 6

                }

            }

        ]

    },

    {

        "question": "Как вы относитесь к одиночеству?",

        "options": [

            {

                "text": "Обожаю",

                "excludes": ["Красный фламинго", "Лемур кошачий"],

                "weights": {

                    "Амурский тигр": 8,

                    "Белый медведь": 7,

                    "Ирбис (снежный барс)": 10,

                    "Манул": 9,

                    "Фенек": 6,

                    "Черный лебедь": 5,

                    "Японский журавль": 4

                }

            },

            {

                "text": "Терплю",

                "excludes": ["Ирбис (снежный барс)", "Манул"],

                "weights": {

                    "Амурский тигр": 6,

                    "Белый медведь": 5,

                    "Фенек": 7,

                    "Красный фламинго": 8,

                    "Лемур кошачий": 9,

                    "Черный лебедь": 7,

                    "Японский журавль": 6

                }

            },

            {

                "text": "Ненавижу",

                "excludes": ["Белый медведь", "Амурский тигр"],

                "weights": {

                    "Ирбис (снежный барс)": 3,

                    "Манул": 2,

                    "Фенек": 8,

                    "Красный фламинго": 10,

                    "Лемур кошачий": 9,

                    "Черный лебедь": 7,

                    "Японский журавль": 6

                }

            }

        ]

    },

    {

        "question": "Ваша стратегия охоты?",

        "options": [

            {

                "text": "Засада",

                "excludes": ["Красный фламинго", "Лемур кошачий"],

                "weights": {

                    "Амурский тигр": 10,

                    "Белый медведь": 8,

                    "Ирбис (снежный барс)": 9,

                    "Манул": 7,

                    "Фенек": 5,

                    "Черный лебедь": 3,

                    "Японский журавль": 4

                }

            },

            {

                "text": "Преследование",

                "excludes": ["Манул", "Черный лебедь"],

                "weights": {

                    "Амурский тигр": 9,

                    "Белый медведь": 7,

                    "Ирбис (снежный барс)": 8,

                    "Фенек": 6,

                    "Красный фламинго": 5,

                    "Лемур кошачий": 4,

                    "Японский журавль": 3

                }

            },

            {

                "text": "Коллективная охота",

                "excludes": ["Ирбис (снежный барс)", "Манул"],

                "weights": {

                    "Амурский тигр": 4,

                    "Белый медведь": 3,

                    "Фенек": 7,

                    "Красный фламинго": 9,

                    "Лемур кошачий": 10,

                    "Черный лебедь": 6,

                    "Японский журавль": 5

                }

            }

        ]

    },

    {

        "question": "Как вы относитесь к воде?",

        "options": [

            {

                "text": "Обожаю плавать",

                "excludes": ["Фенек", "Манул"],

                "weights": {

                    "Амурский тигр": 7,

                    "Белый медведь": 10,

                    "Ирбис (снежный барс)": 4,

                    "Красный фламинго": 8,

                    "Лемур кошачий": 6,

                    "Черный лебедь": 9,

                    "Японский журавль": 5

                }

            },

            {

                "text": "Избегаю",

                "excludes": ["Белый медведь", "Черный лебедь"],

                "weights": {

                    "Амурский тигр": 8,

                    "Ирбис (снежный барс)": 9,

                    "Манул": 10,

                    "Фенек": 7,

                    "Красный фламинго": 5,

                    "Лемур кошачий": 6,

                    "Японский журавль": 4

                }

            },

            {

                "text": "Нейтрально",

                "excludes": [],

                "weights": {

                    "Амурский тигр": 6,

                    "Белый медведь": 5,

                    "Ирбис (снежный барс)": 7,

                    "Манул": 6,

                    "Фенек": 7,

                    "Красный фламинго": 8,

                    "Лемур кошачий": 7,

                    "Черный лебедь": 6,

                    "Японский журавль": 5

                }

            }

        ]

    },

    {

        "question": "Ваш размер группы?",

        "options": [

            {

                "text": "Одинокий хищник",

                "excludes": ["Красный фламинго", "Лемур кошачий"],

                "weights": {

                    "Амурский тигр": 10,

                    "Белый медведь": 9,

                    "Ирбис (снежный барс)": 8,

                    "Манул": 7,

                    "Фенек": 6,

                    "Черный лебедь": 5,

                    "Японский журавль": 4

                }

            },

            {

                "text": "Семейная пара",

                "excludes": ["Ирбис (снежный барс)", "Манул"],

                "weights": {

                    "Амурский тигр": 6,

                    "Белый медведь": 7,

                    "Фенек": 8,

                    "Красный фламинго": 9,

                    "Лемур кошачий": 10,

                    "Черный лебедь": 7,

                    "Японский журавль": 6

                }

            },

            {

                "text": "Большая стая",

                "excludes": ["Белый медведь", "Амурский тигр"],

                "weights": {

                    "Ирбис (снежный барс)": 3,

                    "Манул": 2,

                    "Фенек": 9,

                    "Красный фламинго": 10,

                    "Лемур кошачий": 8,

                    "Черный лебедь": 7,

                    "Японский журавль": 6

                }

            }

        ]

    },

    {

        "question": "Какой цвет вам ближе?",

        "options": [

            {

                "text": "Белый",

                "excludes": ["Красный фламинго", "Фенек"],

                "weights": {

                    "Амурский тигр": 7,

                    "Белый медведь": 10,

                    "Ирбис (снежный барс)": 9,

                    "Манул": 8,

                    "Лемур кошачий": 5,

                    "Черный лебедь": 6,

                    "Японский журавль": 4

                }

            },

            {

                "text": "Рыжий",

                "excludes": ["Белый медведь", "Черный лебедь"],

                "weights": {

                    "Амурский тигр": 9,

                    "Ирбис (снежный барс)": 8,

                    "Манул": 7,

                    "Фенек": 10,

                    "Красный фламинго": 6,

                    "Лемур кошачий": 5,

                    "Японский журавль": 4

                }

            },

            {

                "text": "Черный",

                "excludes": ["Красный фламинго", "Лемур кошачий"],

                "weights": {

                    "Амурский тигр": 6,

                    "Белый медведь": 5,

                    "Ирбис (снежный барс)": 7,

                    "Манул": 8,

                    "Фенек": 4,

                    "Черный лебедь": 10,

                    "Японский журавль": 3

                }

            },

            {

                "text": "Яркие цвета",

                "excludes": ["Белый медведь", "Ирбис (снежный барс)"],

                "weights": {

                    "Амурский тигр": 5,

                    "Манул": 4,

                    "Фенек": 7,

                    "Красный фламинго": 10,

                    "Лемур кошачий": 9,

                    "Черный лебедь": 6,

                    "Японский журавль": 8

                }

            }

        ]

    }

]
